app/Http/Controllers/Auth/LoginAdminController.php

    public function __construct() {
        $admin_panel = DB::table('options')->where('option_key', 'admin_url')->value('option_value');
---
select `option_value` from `options` where `option_key` = 'admin_url' limit 1