app/Model/Options.php

    public static function get_Option($option_group, $array_option_key) {
//         whereIn('option_group', $option_group)->
        $options = Options::whereIn('option_key', $array_option_key)->get();
---
select * from `options` where `option_key` in ('pagi_limit', 'site_title', 'site_url', 'site_open')