app/Model/SessionTime.php

    public static function countDay($day_name) {
        $count = static::select(DB::raw('COUNT(*)  count'))->where('day_name',$day_name)->get();
        return $count[0]->count;
---
select COUNT(*)  count from `session_times` where `day_name` = 'Sat'

    public static function lastTime($start_time, $end_time) {
        $start='2018-11-15 '.$start_time;
        $end='3000-12-31 '.$end_time;
//        $start='2018-11-16 12:17:54.921525';
//       $end='2018-11-16 23:59:59.999999';
        $count = static::select(DB::raw('COUNT(*)  count'))->whereBetween(DB::raw('created_at'), [$start, $end])->get();
        return $count[0]->count;
---
select COUNT(*)  count from `session_times` where hour_in between '06:00:00' and '12:00:00'

    public static function lastDay($day, $date) {
        $count = static::select(DB::raw('COUNT(*)  count'))->whereBetween(DB::raw('created_at'), [$day, $date])->get();
        return $count[0]->count;
---
select COUNT(*)  count from `session_times` where created_at between '2018-01-01' and '2018-01-31'