app/Http/Controllers/Site/SiteController.php

select `option_value` from `options` where `option_key` = 'pagi_limit' limit 1
select `option_value` from `options` where `option_key` = 'site_title' limit 1
select `option_value` from `options` where `option_key` = 'site_url' limit 1
---
    public function __construct()
    {
        $limit_view = DB::table('options')->where('option_key', 'pagi_limit')->value('option_value');
        $limit = is_numeric($limit_view) ? $limit_view : 12;
        $site_title = DB::table('options')->where('option_key', 'site_title')->value('option_value');
        $site_url = DB::table('options')->where('option_key', 'site_url')->value('option_value');