app/User.php

    public static function lastMonth($month,$date){

        $count = static::select(DB::raw('COUNT(*)  count'))->whereBetween(DB::raw('created_at'), [$month, $date])->get();
---
select COUNT(*)  count from `users` where created_at between '2018-09-18' and '2018-10-19'

    public static function lastWeek($week,$date){

        $count = static::select(DB::raw('COUNT(*)  count'))->whereBetween(DB::raw('created_at'), [$week, $date])->get();
---
select COUNT(*)  count from `users` where created_at between '2018-11-01' and '2018-12-02'

    public static function lastDay($day,$date){

        $count = static::select(DB::raw('COUNT(*)  count'))->whereBetween(DB::raw('created_at'), [$day, $date])->get();
        return $count[0]->count;
---
select COUNT(*)  count from `users` where created_at between '2018-10-17' and '2018-10-19'
select COUNT(*)  count from `users` where created_at between '2018-11-30' and '2018-12-02'