Modules/Posts/Entities/Post.php

select * from `comments` where `post_id` = '1002' and `comments`.`deleted_at` is null order by `created_at` desc limit 1
---
    public function getNewestCommentAttribute(){
      return Comment::where('post_id',$this->id)->orderBy('created_at','desc')->first();