Modules/Posts/Entities/Post.php

    public function files(){
        return $this->hasMany(File::class,'dependent_id','id')->where('type','=','post');;
---
select * from `files` where `type` = 'reply' and `files`.`dependent_id` in ('1002', '1009') and `files`.`deleted_at` is null