app/Providers/AppServiceProvider.php

select `option_value`, `option_key` from `options` where `autoload` = '1'
---
        });

        view()->composer('layouts.app', function($view) {
            $option = DB::table('options')->where('autoload', 1)->pluck('option_value', 'option_key')->toArray();