Modules/Posts/Http/Controllers/PostsController.php

    public function index() {
        if ($this->site_open == 1 || $this->site_open == "1") {
            $user = Auth::user();
            $user_key = $user->name;
            $admin_panel =0;
            if ($user->can(['access-all', 'post-type-all', 'post-all'])) {
                $admin_panel = 1;
            }
//            $title = 'Posts' . " &#8211; " . $this->site_title;
//            View::share('title', $title);
            $posts = Post::OrderBy('created_at', 'desc')->get();
            $reactions = Reaction::where('is_active', 1)->get();
---
select * from `posts` where `posts`.`deleted_at` is null order by `created_at` desc
select * from `reactions` where `is_active` = '1' and `reactions`.`deleted_at` is null