Modules/Posts/Http/Controllers/PostsController.php

select * from `users` where `users`.`id` in ('1000', '1001', '1002')
---
    public function index()
    {
        $users = User::where('id', Auth::user()->id)->first();