app/Http/Controllers/Admin/AdminController.php

select `option_value` from `options` where `option_key` = 'table_limit' limit 1
---
    public function __construct()
    {
        $limit_view = DB::table('options')->where('option_key', 'table_limit')->value('option_value');