app/Http/Controllers/Admin/RoleController.php

    public function index(Request $request) {

        if (!$this->user->can('access-all')) {
            return $this->pageUnauthorized();
        }

        if ($this->user->can('access-all')) {
            $role_edit = $role_delete = $role_create = 1;
        } else {
            $role_edit = $role_delete = $role_create = 0;
        }
        $data = Role::orderBy('id', 'DESC')->paginate($this->limit);
        $type_action='';
        return view('admin.roles.index', compact('type_action','data', 'role_create', 'role_delete', 'role_edit'))->with('i', ($request->input('page', 1) - 1) * 5);
---
select * from `roles` order by `id` desc limit 50 offset 0
select count(*) as aggregate from `roles`