app/Http/Controllers/Admin/UserController.php

            $user_create = 1;
        }

        $data = User::orderBy('id', 'DESC')->paginate($this->limit);
---
select * from `users` order by `id` desc limit 50 offset 0
select count(*) as aggregate from `users`